<?php
// error /////////////////////////////////////////
define('ERR_MAXLENGTH','طول ورودی در این فیلد از طول ماکزیمم تعیین شده بیشتر است.');
define('ERR_MINLENGTH','طول ورودی در این فیلد از طول مینیمم تعیین شده کمتر است.');
define('ERR_MAXNUM','مقدار وارد شده در این فیلد از مقدار ماکزیمم تعیین شده بیشتر است.');
define('ERR_MINNUM','مقدار وارد شده در این فیلد از مقدار مینیمم تعیین شده کمتر است.');
define('ERR_NUMBER','این فیلد باید عدد باشد.');
define('ERR_INTEGER','این فیلد باید عدد صحیح باشد.');
define('ERR_EMAIL','آدرس ایمیل صحیح نمی باشد.');
define('ERR_REQUIRED','این فیلد ضروری می باشد.');
define('ERR_PASSWORD','نام کاربری و کلمه عبور درست نمی باشد.');
define('ERR_ISSETUSERNAME','نام کاربری قبلا مورد استفاده قرار گرفته است.');
define('ERR_ISSETEMAIL','آدرس ایمیل قبلا مورد استفاده قرار گرفته است.');
define('ERR_NOTISSETEMAIL','آدرس ایمیل موجود نمی باشد.');
define('ERR_CAPTCHA','تصویر امنیتی مطابقت ندارد.');
define('ERR_LOGIN','شما وارد نشده اید.');
define('ERR_ACCESS','عدم دسترسی.');
define('ERR_IMAGESIZE','حجم عکس باید کمتر از 500 کیلوبایت باشد.');
define('ERR_IMAGEEXT','فایل آپلود شده عکس نمی باشد.');
define('ERR_IMAGEUPLOAD','خطا در ارسال فایل.');
define('ERR_404','صفحه مورد نظر یافت نشد.');

// success /////////////////////////////////////////
define('SUC_LOGIN','شما وارد شدید.');
define('SUC_SIGNUP','شما وارد شدید. همچنین ایمیل تایید برای شما ارسال شد.');
define('SUC_RESET','لینک بازنشانی کلمه عبور به ایمیل شما ارسال شد.');
define('SUC_EDITUSER','با موفقیت ثبت شد.');
define('SUC_ADDOFF','با موفقیت ثبت شد.');
define('SUC_EDITOFF','با موفقیت ثبت شد.');